# Задача №1:
# В диапазоне натуральных чисел от 2 до 99 определить, сколько из них кратны каждому
# из чисел в диапазоне от 2 до 9.

x_2 = 0
x_3 = 0
x_4 = 0
x_5 = 0
x_6 = 0
x_7 = 0
x_8 = 0
x_9 = 0

for i in range(2, 100):
    if i % 2 == 0:
        x_2 += 1
    if i % 3 == 0:
        x_3 += 1
    if i % 4 == 0:
        x_4 += 1
    if i % 5 == 0:
        x_5 += 1
    if i % 6 == 0:
        x_6 += 1
    if i % 7 == 0:
        x_7 += 1
    if i % 8 == 0:
        x_8 += 1
    if i % 9 == 0:
        x_9 += 1

print(f'Чисел кратно: \n'
      f'2: {x_2},   3: {x_3}, \n'
      f'4: {x_4},   5: {x_5}, \n'
      f'6: {x_6},   7: {x_7}, \n'
      f'8: {x_8},   9: {x_9}.')
